import React from 'react';

const PrivacyPolicy = () => {
    return (<div className="text-container">
        <div className="text">
            <p><strong>Политика конфиденциальности для расширения Forbidden GDZ</strong></p>
            <p>Последнее обновление: 13.11.2024</p>
            <p>
                Мы, разработчики расширения Forbidden GDZ, стремимся защитить вашу конфиденциальность и обеспечивать
                прозрачность в отношении данных, которые мы собираем, используем и делимся. В настоящей Политике
                конфиденциальности объясняется, какие данные мы собираем, как они используются и как мы обеспечиваем их
                безопасность.
            </p>
            <h3>1. Сбор и использование информации</h3>
            <p>
                <strong>1.1. Собираемые данные</strong>
                <br/>
                Мы собираем данные, которые пользователи отправляют через платформы <em>Stepik, LearningApps, Google
                Forms</em>, чтобы предоставить возможность решать задания другим пользователям расширения. Данные
                включают:
            </p>
            <ul>
                <li>Результаты выполнения заданий.</li>
                <li>Правильные ответы, найденные пользователями на указанных платформах.</li>
                <li>Уникальный идентификатор пользователя на платформе <em>Stepik.org</em> для идентификации действий
                    конкретного пользователя и улучшения персонализированного предоставления услуг.
                </li>
            </ul>
            <p>
                <strong>1.2. Цели использования данных</strong>
                <br/>Мы используем собранные данные для:
            </p>
            <ul>
                <li>Автоматического предоставления решений другим пользователям расширения.</li>
                <li>Улучшения функциональности расширения, обеспечивая доступ к правильным ответам для всех
                    пользователей.
                </li>
                <li>Персонализации использования расширения и улучшения качества обслуживания.</li>
            </ul>
            <p>
                <strong>1.3. Ограничения использования данных</strong>
                <br/>
                Собранные данные используются исключительно в рамках функциональности расширения Forbidden GDZ и не
                передаются третьим лицам.
            </p>
            <h3>2. Хранение и безопасность данных</h3>
            <p>
                Мы принимаем меры для защиты данных, которые собираются в процессе использования расширения. В
                частности:
            </p>
            <ul>
                <li>Данные хранятся в защищённой базе данных с ограниченным доступом.</li>
                <li>Мы используем современные технологии шифрования и другие меры безопасности для защиты данных от
                    несанкционированного доступа или утраты.
                </li>
            </ul>
            <h3>3. Обмен информацией с третьими сторонами</h3>
            <p>
                Мы не передаем ваши данные третьим сторонам, за исключением случаев, предусмотренных законодательством
                или требуемых для исполнения юридических обязательств.
            </p>
            <h3>4. Права пользователей</h3>
            <p>Вы имеете право:</p>
            <ul>
                <li>Узнавать, какие данные о вас собираются и как они используются.</li>
                <li>Запросить удаление ваших данных из нашей системы.</li>
            </ul>
            <p>
                Для реализации своих прав или получения дополнительной информации, пожалуйста, свяжитесь с нами по
                электронной почте: forbiddengdz@mail.ru.
            </p>
            <h3>5. Изменения в политике конфиденциальности</h3>
            <p>
                Мы оставляем за собой право вносить изменения в данную Политику конфиденциальности. Все изменения будут
                опубликованы на этой странице, и мы рекомендуем регулярно её проверять. Дата последнего обновления
                указана в начале документа.
            </p>
        </div>
    </div>);
};

export default PrivacyPolicy;